package HW2_Zlatopolskii;
//ƒаны два пр¤моугольника, стороны которых параллельны или перпендику-
//л¤рны ос¤м координат. »звестны координаты левого нижнего угла каждого из
//них и длины их сторон. ќдин из пр¤моугольников назовем первым, другой Ч
//вторым.
//а) ќпределить, принадлежат ли все точки первого пр¤моугольника второму.
//б) ќпределить, принадлежат ли все точки одного из пр¤моугольников другому.
//в)* ќпределить, пересекаютс¤ ли эти пр¤моугольники.
public class HW_2_Zlatopolskii_4_69{
	public static void main (String [] args){
		int r=0;
		int res=ff(r);
		System.out.println(res);
	}
	public static int ff(int a){
		if (a<=0) {
			throw new IllegalArgumentException();
		}
		int ret=0;
		
		return ret;
	}
}