package HW2_Zlatopolskii;
//Дано трехзначное число. Определить:
//а) является ли сумма его цифр двузначным числом;
//б) является ли произведение его цифр трехзначным числом;
//в) больше ли числа а произведение его цифр;
//г) кратна ли пяти сумма его цифр;
//д) кратна ли сумма его цифр числу а.
public class HW_2_Zlatopolskii_4_30{
	public static void main (String [] args){
		int r=0;
		int res=ff(r);
		System.out.println(res);
	}
	public static int ff(int a){
		if (a<=0) {
			throw new IllegalArgumentException();
		}
		int ret=0;
		
		return ret;
	}
}