package HW2_Zlatopolskii;
//Даны два прямоугольника, стороны которых параллельны или перпендику-
//лярны осям координат. Известны координаты левого нижнего угла каждого из
//них и длины их сторон. Один из прямоугольников назовем первым, другой —
//вторым.
//а) Определить, принадлежат ли все точки первого прямоугольника второму.
//б) Определить, принадлежат ли все точки одного из прямоугольников другому.
//в)* Определить, пересекаются ли эти прямоугольники.
public class HW_2_Zlatopolskii_4_69{
	public static void main (String [] args){
		int r=0;
		int res=ff(r);
		System.out.println(res);
	}
	public static int ff(int a){
		if (a<=0) {
			throw new IllegalArgumentException();
		}
		int ret=0;
		
		return ret;
	}
}