package HW2_Zlatopolskii;
//Дано вещественное число. Вывести на экран его абсолютную величину (ус-
//ловно принимая, что соответствующей стандартной функции нет). Полный
//условный оператор не использовать.
public class HW_2_Zlatopolskii_4_74{
	public static void main (String [] args){
		int r=0;
		int res=ff(r);
		System.out.println(res);
	}
	public static int ff(int a){
		if (a<=0) {
			throw new IllegalArgumentException();
		}
		int ret=0;
		
		return ret;
	}
}