package HW2_Zlatopolskii;
//Определить, верно ли, что при делении неотрицательного целого числа a на
//положительное число b получается остаток, равный одному из двух заданных
//чисел c или d.
public class HW_2_Zlatopolskii_4_44{
	public static void main (String [] args){
		int r=0;
		int res=ff(r);
		System.out.println(res);
	}
	public static int ff(int a){
		if (a<=0) {
			throw new IllegalArgumentException();
		}
		int ret=0;
		
		return ret;
	}
}